In [28]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [18]:
ela_0612_csv = "Resources/2006-2012-english-language-arts-ela-test-results-charter-schools-1.csv"
ela_1317_csv = "Resources/2013-2017-charter-school-ela-results-all-1.csv"
eladf_0612 = pd.read_csv(ela_0612_csv)
eladf_1317 = pd.read_csv(ela_1317_csv)

In [19]:
eladf_1317.head()

,DBN,School Name,Grade,Year,Category,Number Tested,Mean Scale Score,Level1_N,Level1_%,Level2_N,Level2_%,Level3_N,Level3_%,Level4_N,Level4_%,Level3+4_N,Level3+4_%
0,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2015,All Students,43,306,9,20.9,20,46.5,13,30.2,1,2.3,14,32.6
1,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2016,All Students,52,319,4,7.7,20,38.5,25,48.1,3,5.8,28,53.8
2,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,3,2017,All Students,50,323,2,4,16,32,29,58,3,6,32,64
3,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,4,2016,All Students,40,315,4,10,18,45,14,35,4,10,18,45
4,84K037,BEGINNING WITH CHILDREN CHARTER SCHOOL II,4,2017,All Students,52,320,4,7.7,18,34.6,21,40.4,9,17.3,30,57.7

In [20]:
eladf_1317 = eladf_1317[eladf_1317.Grade != 'All Grades']
eladf_0612 = eladf_0612[eladf_0612.Grade != 'All Grades']

In [21]:
eladf_1317 = eladf_1317[eladf_1317.Grade == '3']
eladf_0612 = eladf_0612[eladf_0612.Grade == '3']

In [22]:
ela_cols = ['DBN','Grade','Year','Number Tested','Mean Scale Score']
eladf_1317 = eladf_1317[ela_cols]
eladf_0612 = eladf_0612[ela_cols]

In [23]:
eladf_1317.head()

       DBN Grade  Year  Number Tested Mean Scale Score
0   84K037     3  2015             43              306
1   84K037     3  2016             52              319
2   84K037     3  2017             50              323
9   84K125     3  2015             56              322
10  84K125     3  2016             78              340

In [24]:
eladf_1317 = eladf_1317.rename(columns={"DBN": "dbn", "Grade": "grade", "Year": "year","Number Tested": "number_tested", "Mean Scale Score": "mean_scale_score"})
eladf_0612 = eladf_0612.rename(columns={"DBN": "dbn", "Grade": "grade", "Year": "year","Number Tested": "number_tested", "Mean Scale Score": "mean_scale_score"})

In [25]:
#eladf_1317 = eladf_1317.groupby('DBN')
#eladf_0612 = eladf_0612.groupby('DBN')
#eladf_1317.first()

In [26]:
#eladf_0612.first()

In [29]:
rds_connection_string = "postgres:Fairfield66@localhost:5432/ETL_Project"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [30]:
engine.table_names()

['math_06_12', 'ela_06_12', 'math_13_17', 'ela_13_17']

In [31]:
eladf_1317.to_sql(name='ela_13_17', con=engine, if_exists='append', index=False)

In [32]:
pd.read_sql_query('select * from ela_13_17', con=engine).head()

      dbn  grade  year  number_tested  mean_scale_score
0  84K037      3  2015             43               306
1  84K037      3  2016             52               319
2  84K037      3  2017             50               323
3  84K125      3  2015             56               322
4  84K125      3  2016             78               340

In [33]:
eladf_0612.to_sql(name='ela_06_12', con=engine, if_exists='append', index=False)

In [34]:
pd.read_sql_query('select * from ela_06_12', con=engine).head()

      dbn  grade  year  number_tested  mean_scale_score
0  84K356      3  2008             85               682
1  84K356      3  2009             76               675
2  84K356      3  2010             86               668
3  84K356      3  2011             78               669
4  84K356      3  2012             69               669